<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"64c6e9669ffbcfeb0b5e374dc5a30e7387f39d7c5befff5e24f2e4add8710b49","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #668 at https://github.com/cal-itp/data-infra/actions/runs/17862694786","plan_out_hash":"a6d62506b8357f6db3df37c2e37e803b42be4f365fd4f932b5315eb2895e4d90","plan_hash":"89d4485b913a49cf582a545190ca385795bd6a00ffffdb548e31d7429b53006b","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "5injcQ==" -> (known after apply)
!~      detect_md5hash      = "leYPrEvyhX2gTdNzoFucHA==" -> "different hash"
!~      generation          = 1758233281674793 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "leYPrEvyhX2gTdNzoFucHA==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/create_row_access_policy.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "Mzal3Q==" -> (known after apply)
!~      detect_md5hash      = "16ncA8VZOBGaK4mITgGyuA==" -> "different hash"
!~      generation          = 1758233280821153 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/macros/create_row_access_policy.sql"
!~      md5hash             = "16ncA8VZOBGaK4mITgGyuA==" -> (known after apply)
        name                = "data/warehouse/macros/create_row_access_policy.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "sOxjZw==" -> (known after apply)
!~      detect_md5hash      = "IEOyzM2hoz24qpCMRLnkjA==" -> "different hash"
!~      generation          = 1758233283443205 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "IEOyzM2hoz24qpCMRLnkjA==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #668](https://github.com/cal-itp/data-infra/actions/runs/17862694786)